src/cf/Catalogs/уатРаботыПоРемонту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатРаботыПоРемонту</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатНормочасыРаботПоРемонту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНормочасыРаботПоРемонту</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоНЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСвязанныеРаботыПоРемонту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСвязанныеРаботыПоРемонту</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяРабота</Name>
					<Comment>Связанная авторабота или номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРаботыПоРемонту</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/уатРаботыПоРемонту/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Ссылка.Пустая() Тогда
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			ПредопределенноеЗначение("Справочник.уатРаботыПоРемонту.ПустаяСсылка"), ВидСравненияКомпоновкиДанных.Равно);
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(СвязанныеРаботы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			ПредопределенноеЗначение("Справочник.уатРаботыПоРемонту.ПустаяСсылка"), ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
		уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(СвязанныеРаботы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
			Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	Модифицированность=Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(Нормочасы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	уатОбщегоНазначенияКлиент.УстановитьОтборУСписка(СвязанныеРаботы.Отбор, Новый ПолеКомпоновкиДанных("Работа"), 
		Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыНормочасы

&НаКлиенте
Процедура НормочасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.Работа = Объект.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура НормочасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		Ответ = Неопределено;
		Отказ = Истина;
		ТекстНСТР = НСтр("en='It is necessary to record element to perform this operation! Continue?';ru='Для выполнения этой операции необходимо записать элемент! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("НормочасыПередНачаломДобавленияЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормочасыПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			Записать();
		Исключение
			Возврат;
		КонецПопытки;
		Если Не Объект.Ссылка.Пустая() Тогда
			ФормаЗаписи = ПолучитьФорму("РегистрСведений.уатНормочасыРаботПоРемонту.Форма.ФормаЗаписи");
			ФормаЗаписи.Запись.Работа = Объект.Ссылка;
			ФормаЗаписи.Открыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязанныеРаботы

&НаКлиенте
Процедура СвязанныеРаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.Работа = Объект.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРаботыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		Ответ = Неопределено;
		Отказ = Истина;
		ТекстНСТР = НСтр("en='It is necessary to record element to perform this operation! Continue?';ru='Для выполнения этой операции необходимо записать элемент! Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СвязанныеРаботыПередНачаломДобавленияЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеРаботыПередНачаломДобавленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			Записать();
		Исключение
			Возврат;
		КонецПопытки;
		Если Не Объект.Ссылка.Пустая() Тогда
			ФормаЗаписи = ПолучитьФорму("РегистрСведений.уатСвязанныеРаботыПоРемонту.Форма.ФормаЗаписи");
			ФормаЗаписи.Запись.Работа = Объект.Ссылка;
			ФормаЗаписи.Открыть();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
